# ViewDisplayModel Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewDisplayModel Members
ViewDisplayModel Class Methods Properties See Also
---
The ViewDisplayModel type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ViewDisplayModel |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| EnableSilhouettes | True to show silhouettes edges. False to disable showing them. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| ShowHiddenLines | True to enable hidden lines. False to disable showing them. |
| SilhouetteEdgesGStyleId | Style ID for silhouette edges |
| SmoothEdges | True to enable "smooth edge" (anti-aliasing) effect. False to disable it. |
| Transparency | The percentage (0..100) of surface transparency 0 means the surfaces are opaque, 100 means they are fully transparent |

# See Also
ViewDisplayModel Class
Autodesk.Revit.DB Namespace